<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Swagger文档存储地址
    |--------------------------------------------------------------------------
    */

    'storage_dir' => env('SWAGGER_STORAGE_DIR', 'apidocs'),

    /*
    |--------------------------------------------------------------------------
    | Swagger UI 路由访问地址
    |--------------------------------------------------------------------------
    */

    'router' => env('SWAGGER_DOCS_ROUTER', 'api-doc'),

    /*
    |--------------------------------------------------------------------------
    | Swagger中定义的host
    |--------------------------------------------------------------------------
    | 在开发阶段因为团队中每个人的环境配置不一致，API需要绑定不同的访问地址
    | 以便于个人开发测试。则如果配置该参数则替换 Swagger中的配置的host地址
    */
    'host' => env('SWAGGER_API_HOST', ''),

    /*
    |--------------------------------------------------------------------------
    | Swagger中定义的basePath
    |--------------------------------------------------------------------------
    | 在开发阶段因为团队中每个人的环境配置不一致，API需要绑定不同的访问地址
    | 以便于个人开发测试。则如果配置该参数则替换 Swagger中的配置的basePath地址
    */
    'base_path' => env('SWAGGER_API_BASE_PATH', ''),
];

